#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=13767fcf-97d9-4c05-b5c9-787426ec024f]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cc0263f0-9be5-4905-86af-8d7e8b62c960]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b414a380-c2fc-4953-92dd-9d0cdf5a34e8]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2c867a7c-6bb9-47e4-8a77-9b42287ddc37]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c5b50685-dcf0-4ae2-80e3-308fb016a207]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f5369bbd-9ecd-4006-a057-24f6cbb64134]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d180ba6d-7098-404d-a86e-9e252481ee86]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4eb5ebb4-f239-4a9e-ac84-59f97eaa23ae]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=89f0f00a-4245-4585-91f1-aa0a4551eefa]
module.keycloak_dev.module.onestopauth.module.client_jon-test-13-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=80940e30-42be-4887-ab72-5b7f31e072af]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ad0f24f5-94ad-47d9-90a3-e9c280a6637b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b14318d7-2fef-448d-a616-2379a8be02d4]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c9eaf799-089e-4c0a-aa22-8f13b61591c4]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2e998904-774d-48f6-a932-19867e13e464]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2a0d3020-53e5-4125-8c8f-9ccc07f16046]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=95edc824-5533-47ea-9224-6997adf57152]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ce475809-4d67-4814-b5cc-a79e02daae50]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8f9958b3-f40b-48ae-815e-0fc0271b345b]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dbfcfc06-816a-44e9-9729-bbb0dcbd3ac5]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b736fc9f-a588-487c-a8d5-f9fedd1cf89f]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a1624ea6-ba03-4982-b59d-0f20423d7ed4]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=747dd4c8-c0a7-48cd-bcd4-d41e6f80e63e]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9ff96311-ac47-4bbe-a054-71ab6f55c023]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2feb5617-2be9-483d-8ec0-04ecc6deff3f]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=13b43351-9b51-421f-9482-5baece73e1b7]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c05e19d7-97f3-4bc6-bb4c-4ad1e55e33c1]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f3e28fc6-db24-4da6-b1cc-8d5c7626dd33]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=475b8ae4-62e0-4635-aeae-1faeda2a2f89]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=953cae08-cf43-4838-8f62-01114f55e631]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=05815902-8e7c-4815-a238-8c0cd3baa1ca]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f685c254-23b3-4c35-a608-0fa5d181b4e9]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8d9393f7-1358-471a-9f84-224a92b8f4c4]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=43b348e7-1155-4c6d-a095-8c8f3169acae]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=531e17a2-e21e-4c06-a2de-bdb6e99146ce]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=656ea0c6-04d0-4953-a670-9482828b9b56]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8a5a4f76-baac-470c-b6b1-824a1eaefc71]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=746702ff-4ae3-491f-8c36-e65545ae0c4a]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cbd5024f-0f67-4742-9455-22d089eb0ed3]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c40b6620-e9fb-4746-8a22-04d984a39a9e]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80b5b6f2-f4e0-4941-8699-07e4ac093347]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5a1faafd-d237-4e1a-8c8f-9c84543c7a05]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7dcb4a6c-74f1-4fd5-90ce-9cd04ebaa823]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d0377886-284b-4711-b6a8-676032c32f4a]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=48c22371-0b6b-4313-9dc5-a9af981bb9a3]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e75aabd1-6c1b-446f-95b2-31310949e683]
module.keycloak_dev.module.onestopauth.module.client_email-test-2146.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d188a175-64ad-46f2-b475-d94ffa8214e6]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a486276e-2359-42aa-b7f5-624e9bbdaaac]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b7c4055c-8f66-459f-94e4-cf51b597c772]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c0d6e389-c17c-4c6d-b1a2-4cf9d6049c6a]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=242f559a-5b9f-4351-abda-4aa1cd1ea96f]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7f36873e-e532-4665-adfb-e67bef1bdfdd]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5471293-c661-4e0b-a6f7-5520712c4392]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=68a2f533-ebae-4369-8773-e1a5d2a32306]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2ef72e58-6423-4d3d-b500-5616b969fe5d]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f6b8061d-6338-43a5-a5b8-3719b5f0bc8e]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7ad5bf86-606e-44c0-b602-e3d26dd378e0]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=916cc6a4-7729-45e4-a74b-618aaa83d18a]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=54e80cc7-ebf7-48b0-880e-efa628c7ee70]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b379ada4-dfdd-42f4-818c-2ec3a92ad4a0]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=88561a69-cd7d-4381-a942-2422f0d02936]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=583325d5-1108-4dc3-a278-a11dfb024c27]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c2ac05dc-7383-4ddf-8d74-1d06576d5e94]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b0da9850-619f-4388-b419-c35dc71d8646]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f13c5a82-e594-4403-a728-c6bddd2681ba]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6058e278-c6cb-47dd-881c-4d7c9b2dd1df]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=14a63c25-5444-4943-8bfa-53520c4e2861]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f8ee461d-80a8-4027-a8dd-07573e4d4b35]
module.keycloak_dev.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=14c65911-9b02-4bf5-8723-7555e8425c38]
module.keycloak_dev.module.onestopauth.module.client_august-19-741-pm-694.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bc7f6a47-0e3a-4f2f-9921-1d908e2277c2]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5f709164-1575-43d0-811b-d6aa4909d4d2]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a7cffed4-f8d5-470b-9c6b-9c9c4e14ac55]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=09bf6d82-3a63-431c-8425-faf78176c2f3]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7288becc-cd99-4d6b-a994-e1b347bca160]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b3b6f2f3-b3f9-4536-a261-76f814d5445d]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3316816f-0914-4d89-8734-5204f1779e3c]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e29049d5-4b73-4393-8317-3d6345954adb]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0e6dc80b-df38-4f50-b35e-e6e05cd88d1f]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=33a1b390-37c1-4be6-9c49-6f909795cc4c]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a6e3486f-e971-4f85-bb60-6a17730cb30d]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2fda7e31-0663-4883-b929-8677f2bd8833]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b02dc5ec-a1b7-4c26-8e2f-2e41b8f3ffe4]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e1031198-717d-47c5-9976-269e645e1835]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56200527-3909-4c02-b468-5f91156755fc]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b29956ba-4dd8-43b6-990a-e2a81528b92d]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=383fe8ea-de3a-4915-a52f-860fbf1bbe80]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ef330158-03fc-4eab-8631-5e3297e13e43]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75d8ac36-8156-47d3-b890-97682124dc7c]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5a88a401-584d-4d51-914f-ca95b639616d]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=58107528-7fc6-441f-aef4-7f8fd52bbe3b]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=111cbd3a-93b6-4663-add5-26189645bb2f]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b7e48458-fd2a-4dd7-a07f-606ba16a6ef2]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ae175926-b10c-4e1e-b0d1-dca7d45e5af1]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0ff4b484-25ce-4a9d-b2cd-cef618846d0d]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=54145368-d807-4edb-92bc-0c262b040d6e]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ea249887-de57-4258-b6f4-b70aae7848d8]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=47f1083e-cf1d-4a5a-9298-b56542faec7d]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8d851f77-9abe-499c-b6c1-85c82800140b]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3bbf1856-ce26-4a86-87a2-8e83330980f3]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=35e9a0b2-f32d-4127-a114-e96b6ea2092f]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=01f34eee-1a4d-4f22-92b1-e08852badc69]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0a3c30d8-a46c-4cee-a25f-fd205b3ab4c4]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1171f0c5-d99a-433f-8e06-aa9755dcbbea]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0158e912-ee0b-4c71-9e93-f311c88e0e18]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5776640a-5533-45d8-854a-261a866a39f6]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6c7e0646-6f2a-4eb3-a7f4-31b0c340fe41]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8ff6a0fe-9347-4bf4-813b-6f589390e6c0]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5c0dc433-cdee-409a-a664-454333d15633]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=54ef8733-7d92-4861-856a-a09e62ba595e]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4f8be9c3-6b41-4bfd-8c22-203391a135d5]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4c265439-a0a4-4543-a5eb-0eedc9e6e09d]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7475da75-fab8-4a74-a2f3-98cc61f59a44]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b3a2ad3e-de7d-4181-bfd5-3f883f0f7620]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=203caf5b-7262-4a5e-95e1-2016477c08ce]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d98aa55a-1cd0-4852-bf57-f4cf4b9dc0b2]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bde3707f-383d-4d20-a79d-e4c4f7931b1f]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5eba53a5-babd-4d14-a045-1f17c3e9de05]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdd1b368-149a-4755-899c-397f192c302d]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3d6cbd85-8fe9-4d4c-98b8-1ba6237f628e]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=45505140-54f5-43f1-bbfb-c344e7ba5c4f]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8e62bb06-8108-4787-94d5-7c9962bb3da3]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5ea88be0-05eb-4cb4-b2d5-611e99f35b30]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a2ebb521-ba49-415f-a323-49323d378331]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=23b9755d-529f-4592-ae0b-0525e6dd5165]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f3349e82-7a5a-402a-b0bb-85f6db647a48]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fea3cc75-4ecb-418f-8f33-02e54a7143d0]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=78c8273a-6743-431f-933a-6a3d1ea034da]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5f3687cf-495d-4c47-b420-ef302958b4bd]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7af5bb55-d337-43fe-b601-35dfceb6b9ce]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0be288c9-3008-4b0b-9476-667997192717]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d88c19f8-86da-4ae5-bb41-9257b272479a]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=83ab957d-9026-4268-8783-be60c70a7757]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5d4b88c0-8ce2-41ad-92f5-903bc4bcf045]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=00ca6796-98fc-4d4a-b9fb-fcf28ed78ec3]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7519df91-94ee-4fb5-887f-eca9cb19fa95]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b9aab272-78e1-4cce-bae9-671b7e9dd760]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5ff9a99e-210c-4667-9612-a087313f6869]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3037.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "70d40b37-1a4a-4913-a134-22ac41a34224"
        name                                     = "zz-3037"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }
  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "61b152e3-8586-4ebc-9219-cebcff17b313"
        name                                     = "zz-3037"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "test-3070"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-3070"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_test-3070.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "test-3070"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-3070"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://www.google.ca",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "test-3070"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-3070"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_test-3070.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "test-3070"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-3070"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://www.google.ca",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2920 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*